# FLayer

## Description
Function FLayer returns a handle to the first layer in a VectorWorks document.

```pascal
FUNCTION FLayer : HANDLE;
```

```python
def vs.FLayer():
    return HANDLE
```

## Version
Availability: from All Versions

## Category
* Layers